In [1]:
import pandas as pd

### Q1 List any five functions of pandas library with execution.

In [6]:
# 1.) DataFrame
data= [['himanshu','saini'],['sahil','pasricha'],['jatin','bathla']]
df=pd.DataFrame(data)
df

          0         1
0  himanshu     saini
1     sahil  pasricha
2     jatin    bathla

In [9]:
# 2.) Mean
data1=[[2,3,4],[5,6,7],[8,9,1]]
df1=pd.DataFrame(data1)
df1.mean()

0    5.0
1    6.0
2    4.0
dtype: float64

In [10]:
# 3.) Series
df2=pd.Series([5,3,4,7])
type(df2)

pandas.core.series.Series

In [12]:
# 4.) Read_csv
df3=pd.read_csv('services.csv')

In [27]:
# 5.) Sum
df2.sum()

19

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [29]:
data=[['himanshu','kumar','saini'],['sahil','kumar','pasricha'],['jatin','kumar','bathla']]
df=pd.DataFrame(data,columns=['A','B','C'])
df

          A      B         C
0  himanshu  kumar     saini
1     sahil  kumar  pasricha
2     jatin  kumar    bathla

In [31]:
df.reindex([1,3])

       A      B         C
1  sahil  kumar  pasricha
3    NaN    NaN       NaN

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [32]:
data={'value': [10, 20, 30, 40, 50]}
df=pd.DataFrame(data)
df

   value
0     10
1     20
2     30
3     40
4     50

In [33]:
def sum_three(df):
    first_three=df.iloc[:3]
    return first_three.sum()
sum_three(df)

value    60
dtype: int64

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [34]:
data={'text':['humanshu','saini','sahil']}
df=pd.DataFrame(data)
df

       text
0  humanshu
1     saini
2     sahil

In [35]:
df['word_count']=df['text'].str.len()
df

       text  word_count
0  humanshu           8
1     saini           5
2     sahil           5

### Q5 How are DataFrame.size() and DataFrame.shape() different?

In [2]:
df=pd.DataFrame({'Name':['himanshu','sahil','jatin'],
                'Age':[19,21,21]})
df.size

6

In [3]:
df=pd.DataFrame({'Name':['himanshu','sahil','jatin'],
                'Age':[19,21,21]})
df.shape

(3, 2)

In [4]:
df

       Name  Age
0  himanshu   19
1     sahil   21
2     jatin   21

### Q6 Which function of pandas do we use to read an excel file?

In [ ]:
pd.read_excel('excel_file_path')

### Q7  You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [6]:
df=pd.DataFrame({'Email':['saini@gmail.com','john.doe@example.com']})
df

                  Email
0       saini@gmail.com
1  john.doe@example.com

In [8]:
df[['username','cpmpany']]=df['Email'].str.split("@",expand=True)
df

                  Email  username      cpmpany
0       saini@gmail.com     saini    gmail.com
1  john.doe@example.com  john.doe  example.com

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows:
A B C
1 8 2 7
4 9 1 2

The function should return a new DataFrame that contains only the selected rows.

In [9]:
data = [[ 3, 5, 1],[8, 2, 7],[6, 9, 4],[2, 3, 5],[9, 1, 2]]
df=pd.DataFrame(data,columns=['A','B','C'])
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [10]:
new_df=df[(df['A']>5)&(df['B']<10)]
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [11]:
df=pd.DataFrame({'values':[2,3,4,5,6,7,8]})
df

   values
0       2
1       3
2       4
3       5
4       6
5       7
6       8

In [12]:
df.describe()

         values
count  7.000000
mean   5.000000
std    2.160247
min    2.000000
25%    3.500000
50%    5.000000
75%    6.500000
max    8.000000

In [13]:
df.mean()

values    5.0
dtype: float64

In [14]:
df.median()

values    5.0
dtype: float64

In [15]:
df.std()

values    2.160247
dtype: float64

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'Moving Average' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [16]:
import numpy as np

In [18]:
df=pd.DataFrame(pd.date_range(start='2023-02-10',end='2023-02-26'),columns=['date'])
df['sales']=np.random.randint(100,1000,size=(17))
df[['sales','date']]

    sales       date
0     123 2023-02-10
1     404 2023-02-11
2     794 2023-02-12
3     369 2023-02-13
4     924 2023-02-14
5     643 2023-02-15
6     495 2023-02-16
7     461 2023-02-17
8     945 2023-02-18
9     767 2023-02-19
10    222 2023-02-20
11    374 2023-02-21
12    665 2023-02-22
13    845 2023-02-23
14    507 2023-02-24
15    424 2023-02-25
16    483 2023-02-26

In [19]:
df['moving_average']=df['sales'].rolling(window=7).mean().round(2)
df

         date  sales  moving_average
0  2023-02-10    123             NaN
1  2023-02-11    404             NaN
2  2023-02-12    794             NaN
3  2023-02-13    369             NaN
4  2023-02-14    924             NaN
5  2023-02-15    643             NaN
6  2023-02-16    495          536.00
7  2023-02-17    461          584.29
8  2023-02-18    945          661.57
9  2023-02-19    767          657.71
10 2023-02-20    222          636.71
11 2023-02-21    374          558.14
12 2023-02-22    665          561.29
13 2023-02-23    845          611.29
14 2023-02-24    507          617.86
15 2023-02-25    424          543.43
16 2023-02-26    483          502.86

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
O 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

Your function should create the following DataFrame:
Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday

The function should return the modified DataFrame.

In [20]:
date=pd.date_range(start='2023-01-01',end='2023-01-05')
df=pd.DataFrame({'Date':date})
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [21]:
df['Weekday']=df['Date'].dt.day_name()
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [26]:
data=pd.date_range(start='2022-12-01',end='2023-02-28')
df_date=pd.DataFrame(data,columns=['Date'])
df_date

         Date
0  2022-12-01
1  2022-12-02
2  2022-12-03
3  2022-12-04
4  2022-12-05
..        ...
85 2023-02-24
86 2023-02-25
87 2023-02-26
88 2023-02-27
89 2023-02-28

[90 rows x 1 columns]

In [28]:
start='2023-01-01'
end='2023-01-31'
mask=(df['Date']>start)&(df['Date']<end)
df.loc[mask]

        Date    Weekday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### Q13 To use the basic function of pandas,what is the first end foremost necessary library that needs to be imported.

In [29]:
import pandas as pd